### 📖 Terraform Plan (src/common/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.global.module.dns.azurerm_private_dns_zone.privatelink_azurewebsites has changed
  ~ resource "azurerm_private_dns_zone" "privatelink_azurewebsites" {
        id                                                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net"
        name                                                  = "privatelink.azurewebsites.net"
      ~ number_of_record_sets                                 = 225 -> 229
        tags                                                  = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.application_gateway_itn.azurerm_web_application_firewall_policy.agw will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "agw" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-waf-01"
        name                = "io-p-itn-agw-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_itn.azurerm_web_application_firewall_policy.app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-api-app-waf-01"
        name                = "io-p-itn-agw-api-app-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cosmos_api_weu.azurerm_cosmosdb_account.this will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "this" {
        id                                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
      ~ is_virtual_network_filter_enabled        = false -> true
        name                                     = "io-p-cosmos-api"
        tags                                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (30 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.cosmos_api_weu.azurerm_cosmosdb_sql_container.these["profile-emails-uniqueness-leases-itn"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "these" {
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlDatabases/db/containers/profile-emails-uniqueness-leases-itn"
        name                  = "profile-emails-uniqueness-leases-itn"
        # (7 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 2000 -> 1000
        }

        # (2 unchanged blocks hidden)
    }

  # module.cosmos_api_weu.azurerm_cosmosdb_sql_container.these["profile-emails-uniqueness-leases-itn-002"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "these" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlDatabases/db/containers/profile-emails-uniqueness-leases-itn-002"
        name                = "profile-emails-uniqueness-leases-itn-002"
        # (7 unchanged attributes hidden)

      ~ autoscale_settings {
          ~ max_throughput = 2000 -> 1000
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_assets_cdn_itn.azurerm_monitor_metric_alert.function_assets_health_check will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_assets_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assetscdn-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-assetscdn-func-01-health-check-failed"
        name                     = "io-p-itn-assetscdn-func-01-health-check-failed"
        tags                     = {}
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_assets_cdn_itn.azurerm_monitor_metric_alert.function_assets_response_time will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_assets_response_time" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assetscdn-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-assetscdn-func-01-response-time"
        name                     = "io-p-itn-assetscdn-func-01-response-time"
        tags                     = {}
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app_admin.module.function_admin_itn.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-admin-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-admin-func-01] Health Check Failed"
        name                     = "[io-p-itn-admin-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "3.0.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app_elt.module.function_elt_itn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                                                = (sensitive value)
            # (114 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-elt-rg-01/providers/Microsoft.Web/sites/io-p-itn-elt-func-01"
        name                                           = "io-p-itn-elt-func-01"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "3.0.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_app_elt.module.function_elt_itn.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                                                = (sensitive value)
            # (114 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-elt-rg-01/providers/Microsoft.Web/sites/io-p-itn-elt-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "3.0.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_app_elt.module.function_elt_itn.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-elt-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-elt-func-01] Health Check Failed"
        name                     = "[io-p-itn-elt-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "3.0.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_app_elt.module.storage_account_itn_elt.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-elt-rg-01/providers/Microsoft.Storage/storageAccounts/iopitneltst02"
        name                               = "iopitneltst02"
      ~ public_network_access_enabled      = true -> false
      ~ tags                               = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
        }
        # (95 unchanged attributes hidden)

      ~ blob_properties {
          ~ change_feed_enabled           = false -> true
            # (4 unchanged attributes hidden)
        }

      + identity {
          + type = "SystemAssigned"
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_app_elt.module.storage_account_itn_elt.azurerm_storage_container.this["messages-report-step-final"] will be created
  + resource "azurerm_storage_container" "this" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = {
          + "businessunit"   = "app io"
          + "costcenter"     = "ts000 - tecnologia e servizi"
          + "createdby"      = "terraform"
          + "environment"    = "prod"
          + "managementteam" = "io platform"
          + "modulename"     = "azure_storage_account"
          + "modulesource"   = "dx"
          + "moduleversion"  = "2.0.0"
          + "source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
        }
      + name                              = "messages-report-step-final"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-elt-rg-01/providers/Microsoft.Storage/storageAccounts/iopitneltst02"
    }

  # module.function_app_elt.module.storage_account_itn_elt.azurerm_storage_container.this["messages-report-step1"] will be created
  + resource "azurerm_storage_container" "this" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = {
          + "businessunit"   = "app io"
          + "costcenter"     = "ts000 - tecnologia e servizi"
          + "createdby"      = "terraform"
          + "environment"    = "prod"
          + "managementteam" = "io platform"
          + "modulename"     = "azure_storage_account"
          + "modulesource"   = "dx"
          + "moduleversion"  = "2.0.0"
          + "source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
        }
      + name                              = "messages-report-step1"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-elt-rg-01/providers/Microsoft.Storage/storageAccounts/iopitneltst02"
    }

  # module.function_app_elt.module.storage_account_itn_elt.azurerm_storage_table.this["fneltcommands"] will be created
  + resource "azurerm_storage_table" "this" {
      + id                   = (known after apply)
      + name                 = "fneltcommands"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitneltst02"
    }

  # module.function_app_elt.module.storage_account_itn_elt.azurerm_storage_table.this["fnelterrors"] will be created
  + resource "azurerm_storage_table" "this" {
      + id                   = (known after apply)
      + name                 = "fnelterrors"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitneltst02"
    }

  # module.function_app_elt.module.storage_account_itn_elt.azurerm_storage_table.this["fnelterrorsMessageStatus"] will be created
  + resource "azurerm_storage_table" "this" {
      + id                   = (known after apply)
      + name                 = "fnelterrorsMessageStatus"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitneltst02"
    }

  # module.function_app_elt.module.storage_account_itn_elt.azurerm_storage_table.this["fnelterrorsMessages"] will be created
  + resource "azurerm_storage_table" "this" {
      + id                   = (known after apply)
      + name                 = "fnelterrorsMessages"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitneltst02"
    }

  # module.function_app_elt.module.storage_account_itn_elt.azurerm_storage_table.this["fnelterrorsNotificationStatus"] will be created
  + resource "azurerm_storage_table" "this" {
      + id                   = (known after apply)
      + name                 = "fnelterrorsNotificationStatus"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitneltst02"
    }

  # module.function_app_elt.module.storage_account_itn_elt.azurerm_storage_table.this["fneltexports"] will be created
  + resource "azurerm_storage_table" "this" {
      + id                   = (known after apply)
      + name                 = "fneltexports"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitneltst02"
    }

  # module.function_app_services.module.function_services_dx.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "[REDACTED]"
            # (61 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Web/sites/io-p-itn-funcsvc-func-01"
        name                                           = "io-p-itn-funcsvc-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Platform"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "2.0.2"
            "Source"                                 = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_app_services.module.function_services_dx.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "[REDACTED]"
            # (61 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-funcsvc-rg-01/providers/Microsoft.Web/sites/io-p-itn-funcsvc-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.0.2"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_assets_cdn_itn.module.function_assets_cdn_itn.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assetscdn-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-assetscdn-func-01] Health Check Failed"
        name                     = "[io-p-itn-assetscdn-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "3.0.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
      ~ sku_name                      = "Premium_4" -> "Premium_2"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.0.3"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (20 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (12 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.data.azurerm_private_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-evt-rg"
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_private_endpoint.service_bus_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "service_bus_pep" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01"
        name                          = "io-p-itn-platform-sbns-pep-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_service_bus_namespace"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.0.6"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 18 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.function_app_elt.azurerm_monitor_diagnostic_setting.queue_diagnostic_setting,
  on ../_modules/function_elt/monitor.tf line 1, in resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting":
   1: resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting" {

`metric` has been deprecated in favor of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider

(and 8 more similar warnings elsewhere)
```

</details>
